Revit 2024 API
ComboBoxCurrentChangedEventArgs.OldValue Property
The current item for the ComboBox before the change.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ComboBoxMember OldValue { get; }
Visual Basic
Public ReadOnly Property OldValue As ComboBoxMember
	Get
Visual C++
public:
property ComboBoxMember^ OldValue {
	ComboBoxMember^ get ();
}
See Also
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace